Revit 2027 API
ParameterTypeId.FabricationPartMaterialThickness Property
 "Part Material Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartMaterialThickness { get; }
Public Shared ReadOnly Property FabricationPartMaterialThickness As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartMaterialThickness {
	ForgeTypeId^ get ();
}
static member FabricationPartMaterialThickness : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace